<template>
    <div class="p-common-protocol my-page">

        <my-header
            :isfixed="true"
        >
            <span
                slot="left"
                @click="$router.back( )"
            >
                <mu-icon
                    size="18"
                    value="keyboard_arrow_left"
                />
            </span>
            <span slot="center">
                用户服务协议
            </span>
        </my-header>

        <div class="content">

            <p class="param">
                本协议是您与视源健康之间就使用视源健康服务共同签署的契约，请您仔细阅读本协议！
            </p>

            <p class="param">
                您在申请注册流程中，点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款，您应重点阅读。如您对协议有任何疑问，可向视源健康客服咨询。
            </p>

            <p class="param">
                当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，即表示您已充分阅读、理解并接受本协议的全部内容，并与视源健康达成一致，成为视源健康用户。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。
            </p>

            <p class="param">
                视源健康：包含视源健康公众号、视源健康管理系统等网站及客户端。
            </p>

            <p class="title">
                一、注册使用
            </p>

            <p class="small-title">
                1.1用户资格
            </p>

            <p class="param">
                您确认，在您开始注册程序使用视源健康服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果，且本网站有权注销您的账号，并向您及您的监护人索偿。
            </p>

            <p class="small-title">
                1.2账号说明
            </p>

            <p class="param">
                您注册成功后，视源健康会为您开通一个账号，作为您使用视源健康的唯一身份标示。该账号所有权归属视源健康，您仅拥有使用权。
            </p>

            <p class="param">
                登录账号时，您有权使用您设置或确认的视源健康账号的用户名、邮箱、手机号码、身份证号及您设置的密码、手机验证码登录。
            </p>

            <p class="param">
                您对通过您的账号所进行的活动、行为和事件依法享有权利和承担责任，且不得以任何形式转让账号、授权他人使用您的账号以及与他人交易账号。
            </p>

            <p class="param">
                鉴于网络服务的特殊性，视源健康无义务审核是否是您本人使用该组账号名称及密码、手机验证码，仅审核账号名称及密码、手机验证码是否与数据库中保存的一致，任何人只要输入的账号名称及密码、手机验证码与数据库中保存的一致，即可凭借该组账号名称及密码登陆并获得视源健康所提供的各类服务，所以即使您认为您的账号登陆行为并非您本人所为，视源健康将不承担因此而产生的任何责任。
            </p>

            <p class="param">
                若您在视源健康成功注册账号后，连续24个月时间内未使用该账号，则视源健康有权回收对您的账号，您的账号将不能再登录视源健康，相应服务同时终止。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通告
            </p>

            <p class="title">
                二、用户权利及义务
            </p>

            <p class="param">
                您有权在视源健康上享受健康信息、查看体检报告、查看商品、购买商品等活动，以及视源健康提供的其他服务。
            </p>

            <p class="param">
                1. 用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且视源健康保留终止用户使用视源健康各项服务的权利。
            </p>

            <p class="param">
                2. 用户不得将在本站注册获得的账号借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。
            </p>

            <p class="param">
                3. 用户注册成功后，将产生用户名和密码等账号信息，您可以根据本站规定修改您的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。
            </p>

            <p class="param">
                4. 您有权通过视源健康发布、获取信息、进行信息互通交流等，如果用户提供的信息有误，造成的任何后果自行承担。
            </p>

            <p class="param">
                5. 您享有言论自由权利，并拥有适度修改、删除自己发表的信息、文章、评价的权利。
            </p>

            <p class="param">
                6. 用户不得利用视源健康各项服务在相关网站上进行销售或其他商业行为。用户违反此约定，视源健康将依法追究其法律责任，由此给视源健康造成损失的，视源健康有权进行追偿。
            </p>

            <p class="param">
                7. 用户同意，禁止用户在视源健康上发布任何形式的广告。
            </p>

            <p class="param">
                8. 您不得利用任何非法手段获取其他用户个人信息，不得将其他用户信息用于任何营利或非营利目的，不得泄露其他用户或权利人的个人隐私，否则视源健康有权采取措施制止您的上述行为，情节严重的，将提交公安机关处理。
            </p>

            <p class="param">
                9. 您不得发布任何侵犯他人著作权、商标权等知识产权或其他合法权利的内容。如果有其他用户或权利人发现您发布的信息涉嫌知识产权、或其他合法权益争议的，这些用户或权利人要求视源健康删除您发布的信息，或者采取其他必要措施予以制止的，视源健康将会依法采取这些措施。
            </p>

            <p class="param">
                10. 您理解并保证不在视源健康传播或发表包含以下内容的言论：
            </p>

            <p class="param">
                1) 反对宪法所确定的基本原则，煽动、抗拒、破坏宪法和法律、行政法规实施的。
            </p>

            <p class="param">
                2) 煽动颠覆国家政权，推翻社会主义制度，煽动、分裂国家，破坏国家统一的。
            </p>

            <p class="param">
               3) 损害国家机关信誉的、损害国家荣誉和利益的、损害社会公共利益和涉及国家安全的。
            </p>

            <p class="param">
                4) 煽动民族仇恨、民族歧视，破坏民族团结的。
            </p>

            <p class="param">
                5) 任何包含对种族、性别、宗教、地域内容等歧视的。
            </p>

            <p class="param">
               6) 捏造或者歪曲事实，散布谣言，扰乱社会秩序的。
            </p>

            <p class="param">
                7) 宣扬封建迷信、邪教、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的。
            </p>

            <p class="param">
                8) 骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的、公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的。
            </p>

            <p class="param">
                9) 其他违反宪法和法律行政法规的。
            </p>

            <p class="param">
                11.若您未遵守以上规定的，视源健康有权做出独立判断并采取暂停或注销您的账号、冻结账号内余额等措施。
            </p>

            <p class="title">
                三、视源健康权利及义务
            </p>

            <p class="param">
                1. 视源健康保留变更、中断或终止部分或全部网络服务的权利。
            </p>

            <p class="param">
                2. 视源健康登载的内容仅供用户参考，并不作为诊断及医疗的依据，视源健康并不能保证所有信息的正确性及完整性。
            </p>

            <p class="param">
                3. 视源健康有权对相关数据、所有的申请行为以及与健康信息互通交流有关的其它事项进行审核，并在不符合视源健康要求的情况下给予拒绝或屏蔽。
            </p>

            <p class="param">
                4. 用户同意，视源健康拥有通过邮件、短信电话等形式，向在本站注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。
            </p>

            <p class="param">
                5. 视源健康有义务维护服务平台的正常运行，并努力提升和改进技术，使用户享有的服务得以顺利进行。
            </p>

            <p class="param">
                6. 用户在视源健康发生不当行为，经视源健康核实认为应当终止服务的，视源健康有权随时删除该用户信息及终止服务，且无需征得用户的同意。
            </p>

            <p class="param">
                7. 用户同意，视源健康有权使用用户的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。
            </p>

            <p class="title">
               四、知识产权
            </p>
            
            <p class="param">
                1. 视源健康对所登载信息内容，包括文字、图标、图饰、图表、色彩、版面设计、数据等均享有完全的著作权，并受《中华人民共和国著作权法》及相关法律法规和中国加入的所有知识产权方面的国际条约的保护。
            </p>

            <p class="param">
                2. 视源健康所登载的专有信息，未经视源健康书面授权，任何人不得以任何形式侵犯其著作权，包括擅自复制、链接、非法使用或转载。
            </p>

            <p class="param">
                3. 用户在视源健康网站上发表的文章及图片（包括转贴的文章及图片）版权仅归属原作者所有，若作者有版权声明或原作从其他网站转载而附带有原版权声明者，其版权归属以附带声明为准。
            </p>

            <p class="param">
                4. 任何转载、引用发表于视源健康的版权文章须符合以下规范：
            </p>

            <p class="param">
                1) 用于非商业、非盈利、非广告性目的时需注明作者及文章及图片的出处为“视源健康”或“用于非商业、非盈利、非广；
            </p>

            <p class="param">
                2) 用于商业、盈利、广告性目的时需征得文章或图片原作者的同意，并注明作者姓名、授权范围及原作出处“视源健康”或“用于商业、盈利、广告性目”；
            </p>

            <p class="param">
                3) 任何文章或图片的修改或删除均应保持作者原意并征求原作者同意，并注明授权范围。
            </p>

            <p class="title">
               五、协议变更
            </p>

            <p class="param">
                根据国家法律法规变化及网站运营需要，视源健康有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在本站上即生效，并代替原来的协议。用户可随时登录查阅最新协议； 用户有义务不时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议，可以且应立即停止接受视源健康依据本协议提供的服务；如用户继续使用本网站提供的服务的，即视为同意更新后的协议。视源健康建议您在使用本站之前阅读本协议及本站的公告。 如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。
            </p>

            <p class="title">
               六、协议终止
            </p>

            <div class="small-title">
                6.1终止情形
            </div>

            <p class="param">
                您有权利向视源健康申请注销账号，经视源健康审核通过后，由视源健康注销用户账号，本协议即告终止；
            </p>

            <p class="param">
                在下列情况下，视源健康可以通过注销用户账号方式，单方面解除本协议：
            </p>

            <p class="param">
                1. 在用户违反本协议相关规定时，视源健康有权暂停或终止向该用户提供服务。如该用户在视源健康暂停或终止提供服务后，再一次直接或间接或以他人名义注册为视源健康网站用户的，则视源健康有权再次暂停或终止向该用户提供服务；
            </p>

            <p class="param">
                2. 一经发现用户注册信息中的内容是虚假的，视源健康即有权终止向该用户提供服务；
            </p>

            <p class="param">
                3. 本协议修改或更新时，如用户表示不愿接受新的服务协议的，视源健康有权终止向该用户提供服务；
            </p>

            <p class="param">
                4. 视源健康认为需终止提供服务的其他情况。
            </p>

            <div class="small-title">
                6.2协议终止后处理
            </div>

            <p class="param">
                本协议终止后，除法律有明确规定外，视源健康平台无义务向您或您指定的第三方披露您账号中的任何信息；
            </p>

            <p class="param">
                本协议终止后，视源健康仍享有下列权利：
            </p>

            <p class="param">
                1. 继续保存您留存于视源健康的各类信息；
            </p>

            <p class="param">
                2. 对于您过往的违约行为，视源健康仍可依据本协议向您追究违约责任。
            </p>

            <p class="param">
                其他
            </p>

            <p class="param">
                本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例及/或行业惯例。
            </p>

            <p class="param">
                因本协议相关或因其引起的争议决绝，均应当使用中华人民共和国法律并受中国仲裁机构管辖。您同意，因本协议引起的或与其相关的争议均应当由中国国际经济贸易仲裁委员会华南分会解决，败诉方应承担包括胜诉方律师费在内的一切仲裁费用。
            </p>

        </div>
    </div>
</template>
<script lang="ts">
import MyHeader from '../../../components/my-header/index.vue';
import { Component, Prop, Vue, Watch } from 'vue-property-decorator';

@Component({
    components: {
        MyHeader
    }
})
export default class Protocol extends Vue {

}
</script>
<style lang="less">
@import './index.less';
</style>


